In [1]:
import pandas as pd

In [2]:
grades=pd.Series([97,100,94])

In [3]:
grades

0     97
1    100
2     94
dtype: int64

In [7]:
pd.Series(98.6,range(3))

0    98.6
1    98.6
2    98.6
dtype: float64

In [8]:
grades[0]

97

In [9]:
grades.count()

3

In [10]:
grades.mean()

97.0

In [11]:
grades.min()

94

In [12]:
grades.max()

100

In [13]:
grades.std()

3.0

In [14]:
grades.var()

9.0

In [15]:
grades.describe()

count      3.0
mean      97.0
std        3.0
min       94.0
25%       95.5
50%       97.0
75%       98.5
max      100.0
dtype: float64

In [16]:
#series 2

In [17]:
grades=pd.Series([87,100,94],index=['Wally','Eva','Sam'])

In [18]:
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [19]:
grades=pd.Series({'Wally':87,'Eva':100,'Sam':94})

In [20]:
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [21]:
grades['Eva']

100

In [22]:
grades.Wally

87

In [24]:
grades.values

array([ 87, 100,  94], dtype=int64)

In [25]:
hardware=pd.Series(['Hammer','Saw','Wrench'])

In [26]:
hardware

0    Hammer
1       Saw
2    Wrench
dtype: object

In [28]:
hardware.str.contains('a')

0     True
1     True
2    False
dtype: bool

In [29]:
hardware.str.upper()

0    HAMMER
1       SAW
2    WRENCH
dtype: object

In [30]:
hardware

0    Hammer
1       Saw
2    Wrench
dtype: object

In [31]:
#Exercise

In [34]:
import numpy as np #pandas already imported

In [35]:
temps=np.random.randint(60,101,5)

In [36]:
temps

array([90, 86, 83, 92, 96])

In [37]:
temperature=pd.Series(temps)

In [38]:
temperature

0    90
1    86
2    83
3    92
4    96
dtype: int32

In [39]:
temperature.min()

83

In [40]:
temperature.max()

96

In [41]:
temperature.mean()

89.4

In [42]:
temperature.describe()

count     5.00000
mean     89.40000
std       5.07937
min      83.00000
25%      86.00000
50%      90.00000
75%      92.00000
max      96.00000
dtype: float64

In [43]:
# second Class

In [45]:
grades_dic={'Wally':[87,96,70],'Eva':[100,87,90],
            'Sam':[94,97,90],'katie':[100,81,82],
            'Bob':[83,65,85]}

In [46]:
grades=pd.DataFrame(grades_dic)

In [47]:
grades

   Wally  Eva  Sam  katie  Bob
0     87  100   94    100   83
1     96   87   97     81   65
2     70   90   90     82   85

In [104]:
grades.index=['Top Test','Middle Test','Last Test']

In [105]:
grades

             Wally  Eva  Sam  katie  Bob
Top Test        87  101   94    100   83
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [106]:
grades['Eva']

Top Test       101
Middle Test     87
Last Test       90
Name: Eva, dtype: int64

In [107]:
grades.Sam

Top Test       94
Middle Test    97
Last Test      90
Name: Sam, dtype: int64

In [108]:
#Next Tutorial

In [109]:
grades.iloc[1]

Wally    96
Eva      87
Sam      97
katie    81
Bob      65
Name: Middle Test, dtype: int64

In [110]:
#Slices DataFrame

In [111]:
grades.loc['Top':'Last']

             Wally  Eva  Sam  katie  Bob
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [112]:
grades.iloc[0:2]

             Wally  Eva  Sam  katie  Bob
Top Test        87  101   94    100   83
Middle Test     96   87   97     81   65

In [113]:
grades.loc['Top':'Last']

             Wally  Eva  Sam  katie  Bob
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [114]:
grades.iloc[[0,2]]

           Wally  Eva  Sam  katie  Bob
Top Test      87  101   94    100   83
Last Test     70   90   90     82   85

In [115]:
#Both Rows and Column Selection

In [116]:
grades.loc['Top':'Last',['Eva','katie']]

             Eva  katie
Middle Test   87     81
Last Test     90     82

In [117]:
grades.iloc[[0,2],0:3]

           Wally  Eva  Sam
Top Test      87  101   94
Last Test     70   90   90

In [118]:
#Boolean Indexing

In [119]:
grades[grades>=90]

             Wally    Eva  Sam  katie  Bob
Top Test       NaN  101.0   94  100.0  NaN
Middle Test   96.0    NaN   97    NaN  NaN
Last Test      NaN   90.0   90    NaN  NaN

In [120]:
grades[(grades>=80)&(grades<90)]

             Wally   Eva  Sam  katie   Bob
Top Test      87.0   NaN  NaN    NaN  83.0
Middle Test    NaN  87.0  NaN   81.0   NaN
Last Test      NaN   NaN  NaN   82.0  85.0

In [121]:
#Next

In [122]:
grades.iat[2,0]

70

In [123]:
grades.at['Top','Eva']

KeyError: 'Top'

In [ ]:
grades.at['Top','Eva']=101

In [124]:
grades.at['Top','Eva']

KeyError: 'Top'

In [125]:
grades.iat[1,1]=87

In [126]:
grades.iat[1,1]

87

In [127]:
grades

             Wally  Eva  Sam  katie  Bob
Top Test        87  101   94    100   83
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [128]:
grades.describe()

       Wally     Eva    Sam   katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.67  93.67   87.67  77.67
std    13.20    7.37   3.51   10.69  11.02
min    70.00   87.00  90.00   81.00  65.00
25%    78.50   88.50  92.00   81.50  74.00
50%    87.00   90.00  94.00   82.00  83.00
75%    91.50   95.50  95.50   91.00  84.00
max    96.00  101.00  97.00  100.00  85.00

In [129]:
pd.set_option('precision',2)

In [130]:
grades.describe()

       Wally     Eva    Sam   katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.67  93.67   87.67  77.67
std    13.20    7.37   3.51   10.69  11.02
min    70.00   87.00  90.00   81.00  65.00
25%    78.50   88.50  92.00   81.50  74.00
50%    87.00   90.00  94.00   82.00  83.00
75%    91.50   95.50  95.50   91.00  84.00
max    96.00  101.00  97.00  100.00  85.00

In [131]:
grades.mean()

Wally    84.33
Eva      92.67
Sam      93.67
katie    87.67
Bob      77.67
dtype: float64

In [132]:
grades.T

       Top Test  Middle Test  Last Test
Wally        87           96         70
Eva         101           87         90
Sam          94           97         90
katie       100           81         82
Bob          83           65         85

In [133]:
grades.T.describe()

       Top Test  Middle Test  Last Test
count      5.00         5.00       5.00
mean      93.00        85.20      83.40
std        7.91        13.08       8.23
min       83.00        65.00      70.00
25%       87.00        81.00      82.00
50%       94.00        87.00      85.00
75%      100.00        96.00      90.00
max      101.00        97.00      90.00

In [134]:
#Sort Data from DataFrame

In [135]:
grades

             Wally  Eva  Sam  katie  Bob
Top Test        87  101   94    100   83
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [136]:
grades.sort_index(ascending=False)

             Wally  Eva  Sam  katie  Bob
Top Test        87  101   94    100   83
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [137]:
grades.sort_index(ascending=True)

             Wally  Eva  Sam  katie  Bob
Last Test       70   90   90     82   85
Middle Test     96   87   97     81   65
Top Test        87  101   94    100   83

In [138]:
grades.sort_index(axis=1)

             Bob  Eva  Sam  Wally  katie
Top Test      83  101   94     87    100
Middle Test   65   87   97     96     81
Last Test     85   90   90     70     82

In [139]:
#next Lession

In [140]:
grades

             Wally  Eva  Sam  katie  Bob
Top Test        87  101   94    100   83
Middle Test     96   87   97     81   65
Last Test       70   90   90     82   85

In [144]:
grades.sort_values(by='Middle Test',axis=1,ascending=False)

             Sam  Wally  Eva  katie  Bob
Top Test      94     87  101    100   83
Middle Test   97     96   87     81   65
Last Test     90     70   90     82   85

In [145]:
grades.sort_values(by='Last Test',axis=1,ascending=False)

             Eva  Sam  Bob  katie  Wally
Top Test     101   94   83    100     87
Middle Test   87   97   65     81     96
Last Test     90   90   85     82     70

In [146]:
grades.T.sort_values(by='Top Test',ascending=False)

       Top Test  Middle Test  Last Test
Eva         101           87         90
katie       100           81         82
Sam          94           97         90
Wally        87           96         70
Bob          83           65         85

In [148]:
grades.loc['Top Test'].sort_values(ascending=False)

Eva      101
katie    100
Sam       94
Wally     87
Bob       83
Name: Top Test, dtype: int64

In [152]:
grades.sort_values(by='Top Test',axis=1,ascending=False,inplace=True)

In [153]:
#Exercise

In [154]:
temps={'Mon':[68,89],'Tue':[71,93],'Wed':[66,82],'Thu':[75,97],'Fir':[62,79]}

In [155]:
temps

{'Mon': [68, 89],
 'Tue': [71, 93],
 'Wed': [66, 82],
 'Thu': [75, 97],
 'Fir': [62, 79]}

In [157]:
temperatures=pd.DataFrame(temps,index=['Low','High'])

In [158]:
temperatures

      Mon  Tue  Wed  Thu  Fir
Low    68   71   66   75   62
High   89   93   82   97   79

In [160]:
temperatures.loc[:,'Mon':'Wed']

      Mon  Tue  Wed
Low    68   71   66
High   89   93   82

In [161]:
temperatures.loc['Low']

Mon    68
Tue    71
Wed    66
Thu    75
Fir    62
Name: Low, dtype: int64

In [162]:
pd.set_option('precision',2)

In [163]:
temperatures.mean()

Mon    78.5
Tue    82.0
Wed    74.0
Thu    86.0
Fir    70.5
dtype: float64

In [164]:
temperatures.mean(axis=1)

Low     68.4
High    88.0
dtype: float64

In [165]:
temperatures.describe()

         Mon    Tue    Wed    Thu    Fir
count   2.00   2.00   2.00   2.00   2.00
mean   78.50  82.00  74.00  86.00  70.50
std    14.85  15.56  11.31  15.56  12.02
min    68.00  71.00  66.00  75.00  62.00
25%    73.25  76.50  70.00  80.50  66.25
50%    78.50  82.00  74.00  86.00  70.50
75%    83.75  87.50  78.00  91.50  74.75
max    89.00  93.00  82.00  97.00  79.00